In [1]:
import numpy as np 
import pandas as pd

##  Q.1: Writer pandas series code to get following output without using dictionary:

In [11]:
a = pd.Series([1,4,9,6,7],["a","x","c",2,"e"])

In [12]:
a

a    1
x    4
c    9
2    6
e    7
dtype: int64

### Ques 2:

In [13]:
b = pd.Series({'Bilal':42,"Ayesha":38,"Hadia":39})

In [14]:
b

Bilal     42
Ayesha    38
Hadia     39
dtype: int64

### Ques # 3:

In [22]:
c = pd.DataFrame({'day':['1/1/2017',"1/2/2017","1/3/2017","1/4/2017","1/5/2017","1/6/2017"],
                'temprature':[32,35,28,24,32,31],
                "windspeed":[6,7,2,7,4,2],
                'event':['Rain','Sunny','Snow',"Snow","Rain","Sunny"]})

In [20]:
c

        day  temprature  windspeed  event
0  1/1/2017          32          6   Rain
1  1/2/2017          35          7  Sunny
2  1/3/2017          28          2   Snow
3  1/4/2017          24          7   Snow
4  1/5/2017          32          4   Rain
5  1/6/2017          31          2  Sunny

In [23]:
c.index = ['a','b','c','d','e','f']

In [24]:
c

        day  temprature  windspeed  event
a  1/1/2017          32          6   Rain
b  1/2/2017          35          7  Sunny
c  1/3/2017          28          2   Snow
d  1/4/2017          24          7   Snow
e  1/5/2017          32          4   Rain
f  1/6/2017          31          2  Sunny

In [26]:
print('mean is:',c['temprature'].mean())
print('max is:',c['temprature'].max())
print('min is:',c['temprature'].min())

mean is: 30.333333333333332
max is: 35
min is: 24

 Q.6: Import CSV ‘people.csv’ in the given folder. Keep in mind the following instructions:

You’re required to import only specific columns ["First Name", "Sex", "Email", “Phone”, “Job Title”]

 Set the following columns ["Sex", "Job Title"] as index columns

 Skip following rows [1,5]

 Export the CSV as “NewPeople.csv”

In [32]:
data = pd.read_csv("E:\dataScience\AICP internship tasks\EDA Internship 2.0 Week 2\people.csv",usecols=["First Name", "Sex", "Email","Phone", "Job Title"],index_col=["Sex", "Job Title"], skiprows=[1, 5])
data.head()

                                First Name                      Email  \
Sex    Job Title
Female Phytotherapist              Phillip      bethany14@example.com
Male   Homeopath                  Kristine      bthompson@example.com
       Market researcher           Yesenia  kaitlinkaiser@example.com
       Waste management officer       Erin        tconner@example.org
Female Intelligence analyst      Katherine    conniecowan@example.com

                                                 Phone
Sex    Job Title
Female Phytotherapist                214.112.6044x4913
Male   Homeopath                          277.609.7938
       Market researcher                  584.094.6111
       Waste management officer  001-171-649-9856x5553
Female Intelligence analyst      +1-773-151-6685x49162

In [33]:
data.to_csv('NewPeople.csv')

 Q.7: Import excel sheet ‘SampleWork.xlsx’ in the given folder. Keep in mind the following instructions:

 Import sheet 1

 Import only first and last column from sheet 1

 Skip row 2 while importing the sheet

 Set row 2 as header
 
 export as new sheet.

In [36]:
pip install openpyxl

Collecting openpyxl
  Downloading openpyxl-3.1.2-py2.py3-none-any.whl (249 kB)
     ---------------------------------------- 0.0/250.0 kB ? eta -:--:--
     ---- ---------------------------------- 30.7/250.0 kB 1.4 MB/s eta 0:00:01
     ------ ------------------------------ 41.0/250.0 kB 330.3 kB/s eta 0:00:01
     ------------- ----------------------- 92.2/250.0 kB 655.4 kB/s eta 0:00:01
     ---------------- ------------------- 112.6/250.0 kB 547.6 kB/s eta 0:00:01
     -------------------------------- --- 225.3/250.0 kB 919.0 kB/s eta 0:00:01
     -----------------------------------  245.8/250.0 kB 793.0 kB/s eta 0:00:01
     -----------------------------------  245.8/250.0 kB 793.0 kB/s eta 0:00:01
     -----------------------------------  245.8/250.0 kB 793.0 kB/s eta 0:00:01
     -----------------------------------  245.8/250.0 kB 793.0 kB/s eta 0:00:01
     -----------------------------------  245.8/250.0 kB 793.0 kB/s eta 0:00:01
     -----------------------------------  245.8/250.0 kB 793.0 kB/s eta 0:00:01
     -----------------------------------  245.8/250.0 kB 793.0 kB/s eta 0:00:01
     -----------------------------------  245.8/250.0 kB 793.0 kB/s eta 0:00:01
     -----------------------------------  245.8/250.0 kB 793.0 kB/s eta 0:00:01
     -----------------------------------  245.8/250.0 kB 793.0 kB/s eta 0:00:01
     -----------------------------------  245.8/250.0 kB 793.0 kB/s eta 0:00:01
     ------------------------------------ 250.0/250.0 kB 289.5 kB/s eta 0:00:00
Collecting et-xmlfile (from openpyxl)
  Downloading et_xmlfile-1.1.0-py3-none-any.whl (4.7 kB)
Installing collected packages: et-xmlfile, openpyxl
Successfully installed et-xmlfile-1.1.0 openpyxl-3.1.2
Note: you may need to restart the kernel to use updated packages.

[notice] A new release of pip is available: 23.3.2 -> 24.0
[notice] To update, run: C:\Users\RIZWAN\AppData\Local\Microsoft\WindowsApps\PythonSoftwareFoundation.Python.3.11_qbz5n2kfra8p0\python.exe -m pip install --upgrade pip

In [38]:
data = pd.read_excel("E:\dataScience\AICP internship tasks\EDA Internship 2.0 Week 2\SampleWork.xlsx", sheet_name=0, usecols=[0, -1], skiprows=[1], header=1)

In [39]:
data.head()

    Bilal
0  Sufyan
1   Saiqa
2   Aimen

Ques # 8

In [47]:
AICP_DF = pd.DataFrame({
    'Name': ['Sonia', 'Bilal', 'Hifza', 'Kabir', 'Jazim'],
    'Age': [27, 24, 22, 32, 23],
    'Address': ['Lahore', 'Karachi', 'Peshawar', 'Sialkot', 'lhr'],  # Corrected the quotation marks
    'Qualification': ['BSCS', 'MSc', 'BSIT', 'PhD', 'BBA']
})

In [48]:
AICP_DF

    Name  Age   Address Qualification
0  Sonia   27    Lahore          BSCS
1  Bilal   24   Karachi           MSc
2  Hifza   22  Peshawar          BSIT
3  Kabir   32   Sialkot           PhD
4  Jazim   23       lhr           BBA

In [49]:
df1 = AICP_DF[['Name', 'Qualification']]
df1

    Name Qualification
0  Sonia          BSCS
1  Bilal           MSc
2  Hifza          BSIT
3  Kabir           PhD
4  Jazim           BBA

In [51]:
AICP_DF['Height'] = [5.1, 6.2, 5.1, 5.2, 5.1]
AICP_DF

    Name  Age   Address Qualification  Height
0  Sonia   27    Lahore          BSCS     5.1
1  Bilal   24   Karachi           MSc     6.2
2  Hifza   22  Peshawar          BSIT     5.1
3  Kabir   32   Sialkot           PhD     5.2
4  Jazim   23       lhr           BBA     5.1

In [52]:
AICP_DF.set_index('Name', inplace=True)

In [54]:
# Retrieve row with index "Hifza"
AICP_DF.loc['Hifza']

Age                    22
Address          Peshawar
Qualification        BSIT
Height                5.1
Name: Hifza, dtype: object

In [55]:
AICP_DF.drop(index='Bilal', inplace=True)

In [57]:
AICP_DF

       Age   Address Qualification  Height
Name
Sonia   27    Lahore          BSCS     5.1
Hifza   22  Peshawar          BSIT     5.1
Kabir   32   Sialkot           PhD     5.2
Jazim   23       lhr           BBA     5.1